import { LocalizedScoresheet } from './typing';

export const localizedScoresheet: LocalizedScoresheet = {
  missions: [
    {
      id: 'eib',
      title: 'ביקורת ציוד',
      clauses: [
        {
          description:
            'הרובוט וכל הציוד שלכם נכנסים לחלוטין לתוך אחד מאזורי השיגור והגובה שלהם הוא מתחת ל-305 מ״מ (12 אינץ׳) בזמן ביקורת הציוד שלפני המקצה:'
        }
      ]
    },
    {
      id: 'm01',
      title: 'קולנוע תלת מימד',
      clauses: [
        {
          description: 'הקורה האדומה הקטנה של קולנוע תלת מימד מימין למסגרת השחורה:'
        }
      ]
    },
    {
      id: 'm02',
      title: 'החלפת תפאורה',
      clauses: [
        {
          description: 'הדגל האדום של התיאטרון שלכם מופנה כלפי מטה, וצבע התפאורה הפעילה הוא:',
          labels: ['לא', 'כחול', 'ורוד', 'כתום']
        },
        {
          description:
            '**בונוס:** הדגלים האדומים של שתי הקבוצות מופנים כלפי מטה, והתפאורות שלהן תואמות:'
        }
      ],
      remarks: [
        'לקבוצות מותר להפעיל רק את הדגם שלהן.',
        'לא ניתן לקבל בונוס בתחרויות בהשתתפות מרוחקת, או אם אין קבוצה מולכם.'
      ],
      errors: [{ id: 'm02-e1', description: 'לא יתכן שהתפאורות תואמות.' }]
    },
    {
      id: 'm03',
      title: 'חוויה עוטפת',
      clauses: [{ description: 'כל שלושת המסכים של ״חוויה עוטפת״ מורמים:' }],
      remarks: [
        'כדי לזכות בניקוד, אסור לציוד של הקבוצה לגעת בדגם משימות ״חוויה עוטפת״ בסיום המקצה.'
      ]
    },
    {
      id: 'm04',
      title: '℠MASTERPIECE',
      clauses: [
        {
          description:
            'פריט האמנות מ-LEGO® של הקבוצה שלכם נמצא לפחות באופן חלקי באזור המטרה של המוזיאון:'
        },
        { description: '**בונוס:** ופריט האמנות נתמך לחלוטין על ידי המעמד:' }
      ],
      remarks: [
        'כדי לזכות בבונוס, בסיום המקצה לפריט האמנות מותר לגעת במעמד בלבד, ולמעמד אסור לגעת בציוד של הקבוצה מלבד פריט האמנות.'
      ],
      errors: [{ id: 'm04-e1', description: 'לא ניתן לקבל את הבונוס מבלי לבצע את המשימה.' }]
    },
    {
      id: 'm05',
      title: 'פסל מציאות רבודה',
      clauses: [
        {
          description: 'הידית הכתומה של ״פסל מציאות רבודה״ מסובבת לחלוטין ימינה:'
        }
      ]
    },
    {
      id: 'm06',
      title: 'תאורה והגברה בהופעה',
      clauses: [
        {
          description: 'הידית הכתומה של התאורה מסובבת לחלוטין כלפי מטה:'
        },
        {
          description: 'הידית הכתומה של התאורה מסובבת לחלוטין שמאלה:'
        }
      ]
    },
    {
      id: 'm07',
      title: 'מיצג הולוגרפי',
      clauses: [
        {
          description: 'ידית ההפעלה הכתומה של המיצג ההולוגרפי נמצאת לחלוטין מעבר לקו השחור של הבמה:'
        }
      ]
    },
    {
      id: 'm08',
      title: 'מצלמת דולי',
      clauses: [
        {
          description: 'המצביע הלבן של מצלמת הדולי נמצא משמאל ל:',
          labels: [
            'אף צבע',
            'הכחול הכהה',
            'הכחול הכהה והכחול הבינוני',
            'הכחול הכהה, הכחול הבינוני, והכחול הבהיר'
          ]
        }
      ],
      remarks: [
        'אם המצביע הלבן על אריח צבעוני, תזכו בניקוד עבור אזור המסילה בעל הניקוד הגבוה יותר.'
      ]
    },
    {
      id: 'm09',
      title: 'סט צילום',
      clauses: [
        { description: 'הסירה נוגעת בשטיח ונמצאת לחלוטין מעבר לקו השחור של הסצנה:' },
        { description: 'המצלמה נוגעת בשטיח ונמצאת לפחות חלקית באזור המטרה של המצלמה:' }
      ],
      remarks: [
        'המצלמה כוללת את הלולאה, אך לא את החוט.',
        'לצורך ניקוד, הקו השחור של הסצנה נמתח אנכית מהדופן העליונה של הזירה עד לדופן התחתונה.'
      ]
    },
    {
      id: 'm10',
      title: 'מיקסר צלילים',
      clauses: [
        {
          description: 'מספר הכפתורים המורמים של מיקסר הצלילים:',
          labels: ['0', '1', '2', '3']
        }
      ],
      remarks: [
        'כדי לזכות בניקוד, אסור לציוד של הקבוצה לגעת במיקסר הצלילים או בכפתורים בסיום המקצה.'
      ]
    },
    {
      id: 'm11',
      title: 'מופע אורות',
      clauses: [
        {
          description: 'הסמן הלבן של מופע האורות נמצא באזור:',
          labels: ['אף אזור', 'הצהוב', 'הירוק', 'הכחול']
        }
      ],
      remarks: ['אם הסמן הלבן נמצא בין אזורים, תזכו בניקוד עבור אזור הניקוד הגבוה יותר.']
    },
    {
      id: 'm12',
      title: 'אמן מציאות מדומה',
      clauses: [
        { description: 'התרנגולת מחוברת ושלמה, והוזזה מהמצב ההתחלתי שלה:' },
        { description: '**בונוס:** והיא מעל, או לחלוטין מעבר לנקודה הסגולה:' }
      ],
      errors: [{ id: 'm12-e1', description: 'לא ניתן לקבל את הבונוס מבלי לבצע את המשימה.' }]
    },
    {
      id: 'm13',
      title: 'מכונת יצירה',
      clauses: [
        { description: 'המכסה בצבע כתום-לבן של מכונת היצירה פתוח לחלוטין:' },
        { description: 'התפס הורוד הבהיר של מכונת היצירה מצביע ישר למטה:' }
      ]
    },
    {
      id: 'm14',
      title: 'הבאת קהל',
      clauses: [
        {
          description: 'מספר חברי הקהל הנמצאים לחלוטין בתוך יעד מטרה:',
          labels: ['0', '1', '2', '3', '4', '5', '6', '7']
        },
        {
          description: 'מספר יעדי המטרה בהם יש לפחות חבר קהל אחד לחלוטין בפנים:',
          labels: ['0', '1', '2', '3', '4', '5', '6', '7']
        }
      ],
      errors: [
        { id: 'm14-e1', description: 'מספר היעדים לא יכול להיות גבוה ממספר חברי הקהל.' },
        { id: 'm14-e2', description: 'לא ייתכן שמספר היעדים הוא 0 אם מספר חברי הקהל גדול מ-0' }
      ]
    },
    {
      id: 'm15',
      title: 'הבאת מומחים',
      clauses: [
        {
          description: 'מספר המומחים שנמצאים לפחות חלקית בתוך יעד המטרה שלהם:',
          labels: ['0', '1', '2', '3', '4', '5']
        }
      ],
      remarks: ['כל מומחה כולל את הטבעת והבסיס.']
    },
    {
      id: 'pt',
      title: 'אסימוני דיוק',
      clauses: [
        {
          description: 'מספר אסימוני הדיוק הנותרים הוא:',
          labels: ['0', '1', '2', '3', '4', '5', '6']
        }
      ]
    }
  ],
  errors: []
};
