import { LocalizedScoresheet } from './typing';

export const localizedScoresheet: LocalizedScoresheet = {
  missions: [
    {
      id: 'eib',
      title: 'ביקורת ציוד',
      clauses: [
        {
          description:
            'הרובוט וכל הציוד שלכם נכנסים לחלוטין לתוך אחד מאזורי השיגור והגובה שלהם הוא מתחת ל-305 מ״מ (12 אינץ׳) בזמן ביקורת הציוד שלפני המקצה:'
        }
      ]
    },
    {
      id: 'm01',
      title: 'משתלת אלמוגים',
      clauses: [
        {
          description: 'עץ האלמוגים תלוי על תומך עץ האלמוגים:'
        },
        {
          description: '**בונוס** - תחתית עץ האלמוגים נמצאת בתוך התושבת:'
        },
        {
          description: 'ניצני האלמוגים מופנים כלפי מעלה:'
        }
      ],
      errors: [
        {
          id: 'm01-e1',
          description: 'לא ניתן לקבל את הבונוס מבלי שעץ האלמוגים תלוי על תומך עץ האלמוגים.'
        }
      ]
    },
    {
      id: 'm02',
      title: 'כריש',
      clauses: [
        {
          description: 'הכריש כבר לא נוגע במערה:'
        },
        {
          description: 'הכריש נוגע בשטיח ונמצא לפחות חלקית בבית הגידול של הכריש:'
        }
      ],
      errors: [
        {
          id: 'm02-e1',
          description: 'לא ייתכן שהכריש נמצא בבית הגידול וגם נוגע במערה.'
        }
      ]
    },
    {
      id: 'm03',
      title: 'שונית אלמוגים',
      clauses: [
        {
          description: 'שונית האלמוגים מופנית כלפי מעלה ואינה נוגעת בשטיח:'
        },
        {
          description: 'מספר קטעי השונית שעומדים ופונים כלפי מעלה, במגע עם השטיח ומחוץ לבית:',
          labels: ['0', '1', '2', '3']
        }
      ]
    },
    {
      id: 'm04',
      title: 'צוללן',
      clauses: [
        {
          description: 'הצוללן כבר לא נוגע במשתלת האלמוגים:'
        },
        {
          description: 'הצוללן תלוי על תומך שונית האלמוגים:'
        }
      ],

      remarks: ['"משתלת האלמוגים" כוללת את כל חלקי דגם המשימה של משימה 01.'],
      errors: [
        {
          id: 'm04-e1',
          description: 'לא ייתכן שהצוללן תלוי על תומך שונית האלמוגים וגם נוגע במשתלת האלמוגים.'
        }
      ]
    },
    {
      id: 'm05',
      title: 'דג חכה',
      clauses: [
        {
          description: 'דג החכה לחלוטין בתוך הספינה הטרופה:'
        }
      ]
    },
    {
      id: 'm06',
      title: 'הרימו תורן',
      clauses: [
        {
          description: 'התורן של הספינה הטרופה הורם לחלוטין:'
        }
      ],
      remarks: [
        'התורן של הספינה הטרופה נחשב למורם כאשר הוא פונה כלפי מעלה והתפס מונע ממנו לחזור למיקום ההתחלתי שלו.'
      ]
    },
    {
      id: 'm07',
      title: 'אוצרו של הקראקן',
      clauses: [
        {
          description: 'תיבת האוצר נמצאת לחלוטין מחוץ לקן הקראקן:'
        }
      ]
    },
    {
      id: 'm08',
      title: 'בית גידול מלאכותי',
      clauses: [
        {
          description: 'מספר מקטעי בית הגידול המלאכותי המקבילים לחלוטין לשטיח ומופנים כלפי מעלה:',
          labels: ['0', '1', '2', '3', '4']
        }
      ]
    },
    {
      id: 'm09',
      title: 'מפגש בלתי צפוי',
      clauses: [
        { description: 'היצור הבלתי מזוהה משוחרר:' },
        { description: 'היצור הבלתי מזוהה נמצא לפחות חלקית בנביעת המעמקים:' }
      ],
      errors: [
        {
          id: 'm09-e1',
          description: 'לא ייתכן שהיצור בהלתי מזוהה לא שוחרר וגם נמצא בנביעת המעמקים.'
        }
      ]
    },
    {
      id: 'm10',
      title: 'העבירו את הצוללת',
      clauses: [
        {
          description: 'הדגל הצהוב של הקבוצה שלכם מופנה כלפי מטה:'
        },
        {
          description: 'הצוללת בבירור קרובה יותר לזירה השנייה:'
        }
      ],
      remarks: ['לקבוצות אסור לחסום את הקבוצה בזירה השנייה.']
    },
    {
      id: 'm11',
      title: 'תגלית סונאר',
      clauses: [
        {
          description: 'מספר הלוויתנים שנחשפו:',
          labels: ['0', '1', '2']
        }
      ]
    },
    {
      id: 'm12',
      title: 'האכילו את הלוויתן',
      clauses: [
        {
          description: 'מספר חסילוני הקריל הנמצאים לפחות באופן חלקי בתוך פיו של הלוויתן:',
          labels: ['0', '1', '2', '3', '4', '5']
        }
      ]
    },
    {
      id: 'm13',
      title: 'החליפו את נתיבי השיט',
      clauses: [
        {
          description: 'הספינה נמצאת בנתיב השיט החדש ונוגעת בשטיח:'
        }
      ]
    },
    {
      id: 'm14',
      title: 'איסוף דגימות',
      clauses: [
        {
          description: 'דגימת המים נמצאת לחלוטין מחוץ לאזור דגימת המים:'
        },
        {
          description: 'דגימת קרקעית הים לא נוגעת בקרקעית הים:'
        },
        {
          description: 'דגימת הפלנקטון לא נוגעת ביער האצות:'
        },
        {
          description: 'מספר חלקי הקלשון שכבר לא נוגעים בספינה הטרופה:',
          labels: ['0', '1', '2']
        }
      ]
    },
    {
      id: 'm15',
      title: 'ספינת מחקר',
      clauses: [
        {
          description: 'סמנו את כל החפצים הנמצאים לפחות חלקית בתוך אזור המשא של ספינת המחקר:',
          labels: [
            'אף אחד',
            'דגימת המים',
            'דגימת הפלנקטון',
            'דגימת קרקעית הים',
            'ראש הקלשון',
            'ידית הקלשון',
            'תיבת האוצר'
          ]
        },
        {
          description: 'תפס הנמל נמצא לפחות חלקית בתוך הלולאה של ספינת המחקר:'
        }
      ],
      errors: [
        {
          id: 'm15-e1',
          description: 'לא ניתן לבחור "אף אחד" כאשר יותר מאופציה אחת נבחרה.'
        }
      ]
    },
    {
      id: 'pt',
      title: 'אסימוני דיוק',
      clauses: [
        {
          description: 'מספר אסימוני הדיוק הנותרים הוא:',
          labels: ['0', '1', '2', '3', '4', '5', '6']
        }
      ]
    }
  ],
  errors: [
    {
      id: 'e1',
      description:
        'לא ייתכן שדגימת קרקעית הים עדיין נוגעת בקרקעית הים (M14) ונמצאת בתוך ספינת המחקר.'
    },
    {
      id: 'e2',
      description: 'לא ייתכן שדגימת הפלנקטון עדיין נוגעת ביער האצות (M14) ונמצאת בתוך ספינת המחקר.'
    },
    {
      id: 'e3',
      description:
        'לא ייתכן שנמצאים יותר חלקי קלשון בתוך ספינת המחקר מאשר חלקי קלשון שלא נוגעים בספינה הטרופה (M14).'
    },
    {
      id: 'e4',
      description: 'לא ייתכן שתיבת האוצר עדיין נמצאת בתוך קן הקראקן (M07) וגם בתוך ספינת המחקר.'
    }
  ]
};
