import { LocalizedScoresheet } from './typing';

export const localizedScoresheet: LocalizedScoresheet = {
  missions: [
    {
      id: 'eib',
      title: 'ביקורת ציוד',
      clauses: [
        {
          description:
            'הרובוט וכל הציוד שלכם נכנסים לחלוטין לתוך אחד מאזורי השיגור והגובה שלהם הוא מתחת ל-305 מ״מ (12 אינץ׳) במהלך הביקורת:'
        }
      ]
    },
    {
      id: 'm01',
      title: 'ניקוי משטחים',
      clauses: [
        {
          description: 'מספר משטחי האדמה שנוקו לחלוטין, ונוגעים בשטיח המשחק:',
          labels: ['0', '1', '2']
        },
        {
          description: 'המברשת של הארכיאולוגים אינה נוגעת באתר החפירה:'
        }
      ]
    },
    {
      id: 'm02',
      title: 'חשיפת מפה',
      clauses: [
        {
          description: 'מספר מקטעי שכבת קרקע העליונה אשר הוסטו לחלוטין:',
          labels: ['0', '1', '2', '3']
        }
      ]
    },
    {
      id: 'm03',
      title: 'חוקרת מכרות',
      clauses: [
        {
          description: 'עגלת המכרות שלכם נמצאת נמצאת במגרש של הקבוצה השנייה:'
        },
        {
          description: '**בונוס**: עגלת המכרות של הקבוצה השנייה נמצאת במגרש שלכם:'
        }
      ],
      errors: [
        {
          id: 'm03-e1',
          description: 'ניתן לקבל את הבונוס רק אם עגלת המכרות שלכם נמצאת במגרש של הקבוצה השנייה.'
        }
      ],
      remarks: [
        'עגלת המכרות שלכם חייבת לעבור לחלוטין דרך הכניסה למכרה כדי לקבל בנקודות במשימה זו.',
        'לא ניתן לקבל ניקוד בונוס אם אין קבוצה מולכם או בתחרויות מרוחקות.'
      ]
    },
    {
      id: 'm04',
      title: 'חילוץ זהיר',
      clauses: [
        {
          description: 'החפץ יקר הערך אינו נוגע במכרה:'
        },
        {
          description: 'שני מבני התמך עומדים:'
        }
      ]
    },
    {
      id: 'm05',
      title: 'מי חיו כאן?',
      clauses: [
        {
          description: 'רצפת המבנה פונה לחלוטין כלפי מעלה:'
        }
      ]
    },
    {
      id: 'm06',
      title: 'נפחייה',
      clauses: [
        {
          description: 'מספר גושי העפרה שאינם נוגעים בנפחייה:',
          labels: ['0', '1', '2', '3']
        }
      ]
    },
    {
      id: 'm07',
      title: 'הרמת משאות כבדים',
      clauses: [
        {
          description: 'אבן הרחיים כבר לא נוגעת בבסיס שלה:'
        }
      ]
    },
    {
      id: 'm08',
      title: 'ממגורה',
      clauses: [
        {
          description: 'מספר הפיסות המשומרות הנמצאות מחוץ לממגורה:',
          labels: ['0', '1', '2', '3']
        }
      ]
    },
    {
      id: 'm09',
      title: 'מה מוכרים פה?',
      clauses: [{ description: 'הסככה מורמת לחלוטין:' }, { description: 'הסחורה מורמת:' }]
    },
    {
      id: 'm10',
      title: 'הטו את המאזניים',
      clauses: [
        {
          description: 'המשקל מוטה ונוגע בשטיח:'
        },
        {
          description: 'מגש המאזניים הוסר לחלוטין:'
        }
      ]
    },
    {
      id: 'm11',
      title: 'לדוג חפצים',
      clauses: [
        { description: 'החפצים מורמים מעל לפני הקרקע:' },
        { description: '**בונוס:** גדל המנוף התקרב למנוף לפחות חלקית:' }
      ],
      errors: [
        {
          id: 'm11-e1',
          description: 'ניתן לקבל את הבונוס רק אם החפצים מורמים מעל לפני הקרקע.'
        }
      ]
    },
    {
      id: 'm12',
      title: 'מבצע הצלה',
      clauses: [{ description: 'החול נוקה לחלוטין:' }, { description: 'האונייה הורמה לחלוטין:' }],
      remarks: ['חול נחשב כנוקה לחלוטין כאשר ידית המשיכה עוברת את הקו על השטיח.']
    },
    {
      id: 'm13',
      title: 'שחזור פסל',
      clauses: [{ description: 'הפסל מורם לחלוטין:' }]
    },
    {
      id: 'm14',
      title: 'פורום',
      clauses: [
        {
          description: 'סמנו את כל החפצים הנוגעים בשטיח ונמצאים לפחות חלקית בפורום:',
          labels: [
            'אף אחד',
            'מברשת',
            'עגלת מכרות',
            'מגש מאזניים',
            'שכבת קרקע עליונה',
            'גוש עפרה עם חפץ מאובן',
            'חפץ יקר ערך',
            'אבן רחיים'
          ]
        }
      ],
      errors: [
        {
          id: 'm14-e1',
          description: 'לא ניתן לבחור "אף אחד" כאשר יותר מאופציה אחת נבחרה.'
        }
      ]
    },
    {
      id: 'm15',
      title: 'סימון אתרים',
      clauses: [
        {
          description: 'מספר האתרים בהם דגל נמצא לפחות חלקית בפנים ונוגע בשטיח:',
          labels: ['0', '1', '2', '3']
        }
      ]
    },
    {
      id: 'pt',
      title: 'אסימוני דיוק',
      clauses: [
        {
          description: 'מספר אסימוני הדיוק הנותרים הוא:',
          labels: ['0', '1', '2', '3', '4', '5', '6']
        }
      ]
    }
  ],
  errors: [
    {
      id: 'e1',
      description: 'לא ייתכן שהמברשת נמצאת בפורום (M14) וגם נוגעת באתר החפירה (M01).'
    },
    {
      id: 'e2',
      description:
        'לא ייתכן שעגלת המכרות של הקבוצה השנייה נמצאת בפורום (M14) אם היא לא הועברה למגרש שלכם (M03).'
    },
    {
      id: 'e3',
      description: 'לא ייתכן שמגש המאזניים נמצא בפורום (M14) אם הוא לא הוסר לחלוטין (M10).'
    },
    {
      id: 'e4',
      description:
        'לא ייתכן שגוש העפרה עם החפץ המאובן נמצא בפורום (M14) אם אף גוש עפרה לא הוסר מהנפחיה (M06).'
    },
    {
      id: 'e5',
      description: 'לא ייתכן שאבן הרחיים נמצאת בפורום (M14) וגם נוגעת בבסיס שלה (M07).'
    },
    {
      id: 'e6',
      description: 'לא ייתכן שהחפץ יקר הערך נמצא בפורום (M14) וגם נוגע במכרה (M04).'
    }
  ]
};
